<?php
	// +----------------------------------------------------------------------
	// | Author: 如风 <iwiilbeback@foxmail.com>
	// +----------------------------------------------------------------------
	// | Date  : 2019/12/14
	// +----------------------------------------------------------------------

/**
 * 2019默认的假期定义
 */
$holiday = [
	/**
	 *
	 * 2019
	 * http://www.gov.cn/zhengce/content/2019-12/06/content_5346276.htm
	 * http://www.gov.cn/xinwen/2019-12/06/content_5346393.htm
	 * 各省、自治区、直辖市人民政府，国务院各部委、各直属机构：
	 * 经国务院批准，现将2019年元旦、春节、清明节、劳动节、端午节、中秋节和国庆节放假调休日期的具体安排通知如下。
	 * 一、元旦：2018年12月30日至2019年1月1日放假调休，共3天。2018年12月29日（星期六）上班。
	 * 二、春节：2月4日至10日放假调休，共7天。2月2日（星期六）、2月3日（星期日）上班。
	 * 三、清明节：4月5日放假，与周末连休。
	 * 四、劳动节：5月1日放假。
	 * 五、端午节：6月7日放假，与周末连休。
	 * 六、中秋节：9月13日放假，与周末连休。
	 * 七、国庆节：10月1日至7日放假调休，共7天。9月29日（星期日）、10月12日（星期六）上班。
	 * 节假日期间，各地区、各部门要妥善安排好值班和安全、保卫等工作，遇有重大突发事件，要按规定及时报告并妥善处置，确保人民群众祥和平安度过节日假期。
	 */
	[
		'day' => '20181230',
		'holiday' => '元旦',
		'holiday_remark' => '元旦：2018年12月30日至2019年1月1日放假调休，共3天。2018年12月29日（星期六）上班',
		'begin' => '',
		'end' => '',
	],
	[
		'day' => '20181231',
		'holiday' => '元旦',
		'holiday_remark' => '元旦：2018年12月30日至2019年1月1日放假调休，共3天。2019年12月29日（星期六）上班',
		'begin' => '',
		'end' => ''
	],
	[
		'day' => '20190101',
		'holiday' => '元旦',
		'holiday_remark' => '元旦：2019年12月30日至2019年1月1日放假调休，共3天。2019年12月29日（星期六）上班',
		'begin' => '',
		'end' => ''
	],
	[
		'day' => '20190204',
		'holiday' => '春节',
		'holiday_remark' => '春节:2月4日至10日放假调休，共7天。2月2日（星期六）、2月3日（星期日）上班。',
		'begin' => '',
		'end' => ''
	],
	[
		'day' => '20190205',
		'holiday' => '春节',
		'holiday_remark' => '春节:2月4日至10日放假调休，共7天。2月2日（星期六）、2月3日（星期日）上班。',
		'begin' => '',
		'end' => ''
	],
	[
		'day' => '20190206',
		'holiday' => '春节',
		'holiday_remark' => '春节:2月4日至10日放假调休，共7天。2月2日（星期六）、2月3日（星期日）上班。',
		'begin' => '',
		'end' => ''
	],
	[
		'day' => '20190207',
		'holiday' => '春节',
		'holiday_remark' => '春节:2月4日至10日放假调休，共7天。2月2日（星期六）、2月3日（星期日）上班。',
		'begin' => '',
		'end' => ''
	],
	[
		'day' => '20190208',
		'holiday' => '春节',
		'holiday_remark' => '春节:2月4日至10日放假调休，共7天。2月2日（星期六）、2月3日（星期日）上班。',
		'begin' => '',
		'end' => ''
	],
	[
		'day' => '20190209',
		'holiday' => '春节',
		'holiday_remark' => '春节:2月4日至10日放假调休，共7天。2月2日（星期六）、2月3日（星期日）上班。',
		'begin' => '',
		'end' => ''
	],
	[
		'day' => '20190210',
		'holiday' => '春节',
		'holiday_remark' => '春节:2月4日至10日放假调休，共7天。2月2日（星期六）、2月3日（星期日）上班。',
		'begin' => '',
		'end' => ''
	],
	[
		'day' => '20190405',
		'holiday' => '清明节',
		'holiday_remark' => '清明节：4月5日放假，与周末连休。',
		'begin' => '',
		'end' => ''
	],
	[
		'day' => '20190406',
		'holiday' => '清明节',
		'holiday_remark' => '清明节：4月5日放假，与周末连休。',
		'begin' => '',
		'end' => ''
	],
	[
		'day' => '20190407',
		'holiday' => '清明节',
		'holiday_remark' => '清明节：4月5日放假，与周末连休。',
		'begin' => '',
		'end' => ''
	],
	[
		'day' => '20190501',
		'holiday' => '劳动节',
		'holiday_remark' => '劳动节：5月1日（星期三）放假',
		'begin' => '',
		'end' => ''
	],
	[
		'day' => '20190607',
		'holiday' => '端午节',
		'holiday_remark' => '端午节：6月7日放假，与周末连休。',
		'begin' => '',
		'end' => ''
	],
	[
		'day' => '20190608',
		'holiday' => '端午节',
		'holiday_remark' => '端午节：6月7日放假，与周末连休。',
		'begin' => '',
		'end' => ''
	],
	[
		'day' => '20190609',
		'holiday' => '端午节',
		'holiday_remark' => '端午节：6月7日放假，与周末连休。',
		'begin' => '',
		'end' => ''
	],
	[
		'day' => '20190913',
		'holiday' => '中秋节',
		'holiday_remark' => '中秋节：9月13日放假，与周末连休。',
		'begin' => '',
		'end' => ''
	],
	[
		'day' => '20190914',
		'holiday' => '中秋节',
		'holiday_remark' => '中秋节：9月13日放假，与周末连休。',
		'begin' => '',
		'end' => ''
	],
	[
		'day' => '20190915',
		'holiday' => '中秋节',
		'holiday_remark' => '中秋节：9月13日放假，与周末连休。',
		'begin' => '',
		'end' => ''
	],
	[
		'day' => '20191001',
		'holiday' => '国庆节',
		'holiday_remark' => '国庆节：10月1日至7日放假调休，共7天。9月29日（星期日）、10月12日（星期六）上班',
		'begin' => '',
		'end' => ''
	],
	[
		'day' => '20191002',
		'holiday' => '国庆节',
		'holiday_remark' => '国庆节：10月1日至7日放假调休，共7天。9月29日（星期日）、10月12日（星期六）上班',
		'begin' => '',
		'end' => ''
	],
	[
		'day' => '20191003',
		'holiday' => '国庆节',
		'holiday_remark' => '国庆节：10月1日至7日放假调休，共7天。9月29日（星期日）、10月12日（星期六）上班',
		'begin' => '',
		'end' => ''
	],
	[
		'day' => '20191004',
		'holiday' => '国庆节',
		'holiday_remark' => '国庆节：10月1日至7日放假调休，共7天。9月29日（星期日）、10月12日（星期六）上班',
		'begin' => '',
		'end' => ''
	],
	[
		'day' => '20191005',
		'holiday' => '国庆节',
		'holiday_remark' => '国庆节：10月1日至7日放假调休，共7天。9月29日（星期日）、10月12日（星期六）上班',
		'begin' => '',
		'end' => ''
	],
	[
		'day' => '20191006',
		'holiday' => '国庆节',
		'holiday_remark' => '国庆节：10月1日至7日放假调休，共7天。9月29日（星期日）、10月12日（星期六）上班',
		'begin' => '',
		'end' => ''
	],
	[
		'day' => '20191007',
		'holiday' => '国庆节',
		'holiday_remark' => '国庆节：10月1日至7日放假调休，共7天。9月29日（星期日）、10月12日（星期六）上班',
		'begin' => '',
		'end' => ''
	]
];

/**
 * 默认的调休上班
 */
$workday = [
	[
		'day' => '20181229',
		'holiday' => '',
		'holiday_remark' => '元旦：2019年12月30日至2019年1月1日放假调休，共3天。2019年12月29日（星期六）上班',
		'begin' => '',
		'end' => '',
	],
	[
		'day' => '20190202',
		'holiday' => '',
		'holiday_remark' => '春节：2月4日至10日放假调休，共7天。2月2日（星期六）、2月3日（星期日）上班。',
		'begin' => '',
		'end' => ''
	],
	[
		'day' => '20190203',
		'holiday' => '',
		'holiday_remark' => '春节：2月4日至10日放假调休，共7天。2月2日（星期六）、2月3日（星期日）上班。',
		'begin' => '',
		'end' => ''
	],
	[
		'day' => '20190929',
		'holiday' => '',
		'holiday_remark' => '国庆节：10月1日至7日放假调休，共7天。9月29日（星期日）、10月12日（星期六）上班。',
		'begin' => '',
		'end' => ''
	],
	[
		'day' => '20191012',
		'holiday' => '',
		'holiday_remark' => '国庆节：10月1日至7日放假调休，共7天。9月29日（星期日）、10月12日（星期六）上班。',
		'begin' => '',
		'end' => ''
	],
];
return [
	'workday' => $workday,
	'holiday' => $holiday,
];