<?php
/**
 * Created by PhpStorm.
 * User: darkwind
 * Date: 18-5-2
 * Time: 上午11:04
 */

/**
 * 默认的假期定义
 */
$holiday = [
    /**
     * 2018
     *
     * 经国务院批准，现将2018年元旦、春节、清明节、劳动节、端午节、中秋节和国庆节放假调休日期的具体安排通知如下。
     *  一、元旦：1月1日放假，与周末连休。
     *  二、春节：2月15日至21日放假调休，共7天。2月11日（星期日）、2月24日（星期六）上班。
     *  三、清明节：4月5日至7日放假调休，共3天。4月8日（星期日）上班。
     *  四、劳动节：4月29日至5月1日放假调休，共3天。4月28日（星期六）上班。
     *  五、端午节：6月18日放假，与周末连休。
     *  六、中秋节：9月24日放假，与周末连休。
     *  七、国庆节：10月1日至7日放假调休，共7天。9月29日（星期六）、9月30日（星期日）上班。
     */
    [
        'day' => '20180101',
        'holiday' => '元旦',
        'holiday_remark' => '元旦：1月1日放假，与周末连休',
        'begin' => '',
        'end' => '',
    ],
    [
        'day' => '20180215',
        'holiday' => '春节',
        'holiday_remark' => '2月15日至21日放假调休，共7天。2月11日（星期日）、2月24日（星期六）上班',
        'begin' => '',
        'end' => ''
    ],
    [
        'day' => '20180216',
        'holiday' => '春节',
        'holiday_remark' => '2月15日至21日放假调休，共7天。2月11日（星期日）、2月24日（星期六）上班',
        'begin' => '',
        'end' => ''
    ],
    [
        'day' => '20180217',
        'holiday' => '春节',
        'holiday_remark' => '2月15日至21日放假调休，共7天。2月11日（星期日）、2月24日（星期六）上班',
        'begin' => '',
        'end' => ''
    ],
    [
        'day' => '20180218',
        'holiday' => '春节',
        'holiday_remark' => '2月15日至21日放假调休，共7天。2月11日（星期日）、2月24日（星期六）上班',
        'begin' => '',
        'end' => ''
    ],
    [
        'day' => '20180219',
        'holiday' => '春节',
        'holiday_remark' => '2月15日至21日放假调休，共7天。2月11日（星期日）、2月24日（星期六）上班',
        'begin' => '',
        'end' => ''
    ],
    [
        'day' => '20180220',
        'holiday' => '春节',
        'holiday_remark' => '2月15日至21日放假调休，共7天。2月11日（星期日）、2月24日（星期六）上班',
        'begin' => '',
        'end' => ''
    ],
    [
        'day' => '20180221',
        'holiday' => '春节',
        'holiday_remark' => '2月15日至21日放假调休，共7天。2月11日（星期日）、2月24日（星期六）上班',
        'begin' => '',
        'end' => ''
    ],
    [
        'day' => '20180405',
        'holiday' => '清明节',
        'holiday_remark' => '4月5日至7日放假调休，共3天。4月8日（星期日）上班',
        'begin' => '',
        'end' => ''
    ],
    [
        'day' => '20180406',
        'holiday' => '清明节',
        'holiday_remark' => '4月5日至7日放假调休，共3天。4月8日（星期日）上班',
        'begin' => '',
        'end' => ''
    ],
    [
        'day' => '20180407',
        'holiday' => '清明节',
        'holiday_remark' => '4月5日至7日放假调休，共3天。4月8日（星期日）上班',
        'begin' => '',
        'end' => ''
    ],
    [
        'day' => '20180429',
        'holiday' => '劳动节',
        'holiday_remark' => '4月29日至5月1日放假调休，共3天。4月28日（星期六）上班',
        'begin' => '',
        'end' => ''
    ],
    [
        'day' => '20180430',
        'holiday' => '劳动节',
        'holiday_remark' => '4月29日至5月1日放假调休，共3天。4月28日（星期六）上班',
        'begin' => '',
        'end' => ''
    ],
    [
        'day' => '20180501',
        'holiday' => '劳动节',
        'holiday_remark' => '4月29日至5月1日放假调休，共3天。4月28日（星期六）上班',
        'begin' => '',
        'end' => ''
    ],
    [
        'day' => '20180618',
        'holiday' => '端午节',
        'holiday_remark' => '6月18日放假，与周末连休',
        'begin' => '',
        'end' => ''
    ],
    [
        'day' => '20180924',
        'holiday' => '中秋节',
        'holiday_remark' => '9月24日放假，与周末连休',
        'begin' => '',
        'end' => ''
    ],
    [
        'day' => '20181001',
        'holiday' => '国庆节',
        'holiday_remark' => '10月1日至7日放假调休，共7天。9月29日（星期六）、9月30日（星期日）上班',
        'begin' => '',
        'end' => ''
    ],
    [
        'day' => '20181002',
        'holiday' => '国庆节',
        'holiday_remark' => '10月1日至7日放假调休，共7天。9月29日（星期六）、9月30日（星期日）上班',
        'begin' => '',
        'end' => ''
    ],
    [
        'day' => '20181003',
        'holiday' => '国庆节',
        'holiday_remark' => '10月1日至7日放假调休，共7天。9月29日（星期六）、9月30日（星期日）上班',
        'begin' => '',
        'end' => ''
    ],
    [
        'day' => '20181004',
        'holiday' => '国庆节',
        'holiday_remark' => '10月1日至7日放假调休，共7天。9月29日（星期六）、9月30日（星期日）上班',
        'begin' => '',
        'end' => ''
    ],
    [
        'day' => '20181005',
        'holiday' => '国庆节',
        'holiday_remark' => '10月1日至7日放假调休，共7天。9月29日（星期六）、9月30日（星期日）上班',
        'begin' => '',
        'end' => ''
    ],
    [
        'day' => '20181006',
        'holiday' => '国庆节',
        'holiday_remark' => '10月1日至7日放假调休，共7天。9月29日（星期六）、9月30日（星期日）上班',
        'begin' => '',
        'end' => ''
    ],
    [
        'day' => '20181007',
        'holiday' => '国庆节',
        'holiday_remark' => '10月1日至7日放假调休，共7天。9月29日（星期六）、9月30日（星期日）上班',
        'begin' => '',
        'end' => ''
    ],
];

/**
 * 默认的调休上班
 */
$workday = [
    [
        'day' => '20180211',
        'holiday' => '',
        'holiday_remark' => '2月15日至21日放假调休，共7天。2月11日（星期日）、2月24日（星期六）上班',
        'begin' => '',
        'end' => ''
    ],
    [
        'day' => '20180224',
        'holiday' => '',
        'holiday_remark' => '2月15日至21日放假调休，共7天。2月11日（星期日）、2月24日（星期六）上班',
        'begin' => '',
        'end' => ''
    ],
    [
        'day' => '20180408',
        'holiday' => '',
        'holiday_remark' => '',
        'begin' => '',
        'end' => ''
    ],
    [
        'day' => '20180428',
        'holiday' => '',
        'holiday_remark' => '',
        'begin' => '',
        'end' => ''
    ],
    [
        'day' => '20180929',
        'holiday' => '',
        'holiday_remark' => '',
        'begin' => '',
        'end' => ''
    ],
    [
        'day' => '20180930',
        'holiday' => '',
        'holiday_remark' => '',
        'begin' => '',
        'end' => ''
    ],
];
return [
    'workday' => $workday,
    'holiday' => $holiday,
];